/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: ช่วยทำให้เราสามารถแบ่ง การดำเนินการ อีกส่วนหนึ่งออกมาได้


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer: อ่านง่าย เนื่องจากเราสามารถระบุได้ว่าเราใส่ การดำเนินการ อะไรเข้าไป


3. หากต้องสอนเพื่อนให้เข้าใจ allback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  ให้จินตนาการว่าเราเหมือนมีฟังก์ชันหลักอันหนึ่ง แล้วเรียกใช้การดำเนินการบางอย่าง จากฟังก์ชันย่อย


*/
